OdDAI.DynamicAttributeHolder.getData(OdDAI.AttributeKeyCollection!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Byte*)
\details
Gets data of this object.
\param attributeCollection  [in] Attribute collection.
\param copyTo               [out] Receives the copied data.
\returns
true if the data is copied successfully, false otherwise.

OdDAI.DynamicAttributeHolder.clean(OdDAI.AttributeKeyCollection!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Cleans an attribute collection.
\param attributeCollection        [in/out] Attribute collection to clean.

OdDAI.DynamicAttributeHolder.init(OdDAI.AttributeKeyCollection!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,std.list&lt;std.pair&lt;OdDAI.DynamicAttributeHolder,OdDAI.AttributeKeyCollection!System.Runtime.CompilerServices.IsConst**&gt;,std.allocator&lt;std.pair&lt;OdDAI.DynamicAttributeHolder,OdDAI.AttributeKeyCollection!System.Runtime.CompilerServices.IsConst**&gt;&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Initializes this object for a correct work.
\param attributeCollection        [out] Attribute collection.
\param complexReadDataCollection  [in] Data from which to initialize the attribute collection.

OdDAI.DynamicAttributeHolder.init(OdDAI.AttributeKeyCollection!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Byte!System.Runtime.CompilerServices.IsConst*)
\details
Initializes this object for a correct work.
\param attributeCollection    [out] Attribute collection.
\param initFrom               [in] Data from which to initialize the attribute collection.

OdDAI.DynamicAttributeHolder.outFields(OdDAI.OdSpfFilerBase*,OdDAI.AttributeKeyCollection!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdDAI.Entity*)
\details
Writes object's data the the specified filer.
\param wrFiler                [in] Pointer to a filer to which to write the data.
\param attributeCollection    [in] Attribute collection.
\param complexEntity          [in] Complex entity that is written to a filer.

OdDAI.DynamicAttributeHolder.outFields(OdDAI.OdSpfFilerBase*,OdDAI.AttributeKeyCollection!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Writes object's data the the specified filer.
\param wrFiler                [in] Pointer to a filer to which to write the data.
\param attributeCollection    [in] Attribute collection.

OdDAI.DynamicAttributeHolder.inFields(OdDAI.OdSpfFilerBase*,OdDAI.AttributeKeyCollection!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Reads object's data from the specified filer.
\param rdFiler                [in] Pointer to a filer from which to read the data.
\param attributeCollection    [in] Attribute collection.

OdDAI.DynamicAttributeHolder.unsetAttr(OdSmartPtr&lt;OdDAI.Attribute&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdDAI.AttributeKeyCollection!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Resets a value for the specified attribute.
\param attribute              [in] Attribute to unset.
\param attributeCollection    [in] Attribute collection to search within.
\param inverse                [in] Indicates whether the attribute is inverse attribute.

OdDAI.DynamicAttributeHolder.unsetAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,OdDAI.AttributeKeyCollection!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Resets a value for the specified attribute.
\param attrName               [in] Explicit name of the attribute to reset.
\param attributeCollection    [in] Attribute collection to search within.
\param inverse                [in] Indicates whether the attribute is inverse attribute.

OdDAI.DynamicAttributeHolder.putAttr(OdSmartPtr&lt;OdDAI.Attribute&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdDAI.AttributeKeyCollection!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Sets the specified attribute with a given value.
\param attr                     [in] Attribute to set.
\param val                      [in] Value to set.
\param attributeCollection      [in] Attribute collection to search within.
\param inverse                  [in] Indicates whether the attribute is inverse attribute.
\returns
true if the value is successfully set for the specified attribute, false otherwise.

OdDAI.DynamicAttributeHolder.putAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdDAI.AttributeKeyCollection!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Sets the specified attribute with a given value.
\param attrName                 [in] Explicit name of the attribute to set.
\param val                      [in] Value to set.
\param attributeCollection      [in] Attribute collection to search within.
\param inverse                  [in] Indicates whether the attribute is inverse attribute.
\returns
true if the value is successfully set for the specified attribute, false otherwise.

OdDAI.DynamicAttributeHolder.testAttr(OdSmartPtr&lt;OdDAI.Attribute&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdDAI.AttributeKeyCollection!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Checks whether the specified attribute is set.
\param attribute            [in] Attribute to test.
\param attributeCollection  [in] Attribute collection to search within.
\param inverse              [in] Indicates whether the attribute is inverse attribute.
\returns
true if the specified attribute is set, false otherwise.

OdDAI.DynamicAttributeHolder.testAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,OdDAI.AttributeKeyCollection!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Checks whether the specified attribute is set.
\param attrName             [in] Attribute name of the attribute to test.
\param attributeCollection  [in] Attribute collection to search within.
\param inverse              [in] Indicates whether the attribute is inverse attribute.
\returns
true if the specified attribute is set, false otherwise.

OdDAI.DynamicAttributeHolder.getAttr(OdDAI.Attribute!System.Runtime.CompilerServices.IsConst*,OdDAI.AttributeKeyCollection!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Returns an attribute value by the specified attribute.
\param attr                [in] Attribute to query.
\param attributeCollection [in] Attribute collection to search within.
\param inverse             [in] Indicates whether the attribute is inverse attribute.
\returns
OdRxValue object that represents a generic variant type value.

OdDAI.DynamicAttributeHolder.getAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,OdDAI.AttributeKeyCollection!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Returns an attribute value by the specified attribute name.
\param attrName            [in] Attribute name to query.
\param attributeCollection [in] Attribute collection to search within.
\param inverse             [in] Indicates whether the attribute is inverse attribute.
\returns
OdRxValue object that represents a generic variant type value.

OdDAI.DynamicAttributeHolder.getAttr(OdDAI.AttributeKey!System.Runtime.CompilerServices.IsConst*,OdDAI.AttributeKeyCollection!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns an attribute value by the specified attribute key.
\param attrKey                [in] Pointer to an attribute key to query.
\param attributeCollection    [in/out] Attribute collection.
\returns
OdRxValue object that represents a generic variant type value.

OdDAI.DynamicAttributeHolder.copy(OdDAI.DynamicAttributeHolder!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdDAI.AttributeKeyCollection!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Copies data from the specified attribute holder.
\param from                   [in] Object to copy from.
\param attributeCollection    [in/out] Attribute collection.
\returns true if copied successfully; otherwise the method returns false.

OdDAI.DynamicAttributeHolder.isNull
\details
Checks whether this object has no data.
\returns true if this object has no data; otherwise the method returns false.